{"intents": [
    {"tag": "greeting",
     "patterns": ["สวัสดี","ฮัลโหล", "สบายดีมั้ย", "มีใครอยู่มั้ย","หวัดดี","อันยอง","สวัสดีค่ะ","สวัสดีจ้า","ดีค่ะ"],
     "responses": ["สวัสดี","สวัสดี ขอบคุณที่ทักมานะ", "ยินดีที่ได้รู้จัก", "สวัสดี มีอะไรให้เราช่วยมั้ย","ยินดีที่ได้รู้จักครับ มีอะไรให้เราช่วยมั้ย"],
     "context": [""]
    },
    {"tag": "goodbye",
     "patterns": ["บาย","ไปก่อนนะ"],
     "responses": ["แล้วเจอกันนะ","อย่าลืมกลับมาคุยกันนะ","พบปัญหาทักเราได้เลยนะ!"],
     "context": [""]
    },
    {"tag": "thanks",
     "patterns": ["ขอบคุณ", "ขอบคุณ มีประโยชน์มาก", "เยี่ยมมาก ขอบคุณ", "ขอบคุณที่ช่วยฉัน","แต้งกิิ้วน้าแก","คัมซามีดา"],
     "responses": ["ยินดีช่วย!", "เมื่อไหร่ก็ได้!", "ยินดีมากๆ ครับ"],
     "context": [""]
    },
    {"tag": "noanswer",
     "patterns": [],
     "responses": ["ขออภัย เราไม่เข้าใจ", "โปรดให้ข้อมูลเพิ่มเติมครับ", "เราไม่เข้าใจ"],
     "context": [""]
    },
    {
    "tag": "options",
    "patterns": ["ปัญหาเกี่ยวกับโทรศัพท์","ช่วยหน่อย","คุณช่วยฉันได้อย่างไร", "คุณทำอะไรได้บ้าง", "คุณช่วยอะไรได้บ้าง", "คุณจะช่วยเหลือได้อย่างไร", "มีการสนับสนุนอะไรบ้าง", "คุณให้ความช่วยเหลือเกี่ยวกับโทรศัพท์ได้มั้ย"],
    "responses": ["เราสามารถแนะนำคุณตลอดการบริการ ให้รายละเอียดเกี่ยวกับรุ่นโทรศัพท์และนโยบายการซ่อมของเราได้ครับ", "เสนอรายละเอียดเกี่ยวกับรุ่นที่คุณสนใจ ร้านค้าที่ใกล้ที่สุด ศูนย์บริการ "],
    "context": [""]
    },

    {
    "tag": "repair",
    "patterns": ["โทรศัพท์พังและค้าง ควรทำยังไง", "แสดงรายชื่อศูนย์บริการ", "ศูนย์บริการที่ใกล้ฉันที่สุด", "โทรศัพท์ตกและหน้าจอแตกจะซ่อมได้ที่ไหน", " ฉันนำโทรศัพท์เครื่องใหม่มาแต่มันไม่ตอบสนองหน้าจอไม่มีรอยร้าว ฉันควรทำอย่างไร", "ฉันได้รับโทรศัพท์เมื่อวานนี้แต่มีปัญหาภายในบางอย่างเกิดขึ้น", "คำอธิบายผลิตภัณฑ์ระบุว่ามีปากกาอยู่ในเครื่อง แต่มันหายไป", "ปากกาที่ฉันได้ซื้อมาใช้กับหน้าจอ Ipad pro ไม่ได้ ", "อุปกรณ์เสริมที่ได้รับพร้อมกับโทรศัพท์เสียทั้งหมด", "ฉันไม่ได้รับหูฟังในรุ่น airpod pro", "ที่ชาร์จของโทรศัพท์ไม่ชาร์จ", "โทรศัพท์ของฉันมีปัญหาในการชาร์จ", "มีจุดสีดำปรากฏบนหน้าจอของฉัน", "โทรศัพท์ฉันตกและตอนนี้มีจุดสีชมพูปรากฏขึ้น"],
    "responses": ["ขออภัยในข้อผิดพลาดที่เกิดขึ้น เรารบกวนขอข้อมูล email ติดต่อ","ขออภัยในความไม่สะดวก สามารถไปที่ศูนย์บริการของเราเพื่อรับการซ่อมแซมได้", "ขออภัยสำหรับความไม่สะดวกสบาย โปรดไปที่ศูนย์บริการของเรา"],
    "context": [""]
    },
    {
    "tag": "enquiry",
    "patterns": ["ผลิตภัณฑ์นี้จะออกวางจำหน่ายมั้ย", "ผลิตภัณฑ์ iphone15 จะออกเมื่อไหร่", "รุ่น Iphone 12 pro max ราคาเท่าไหร่", "ฉันสามารถซื้อรุ่น Iphone13 ได้ที่ไหน", "รุ่นใดจะจำหน่าย ของจะกลับมาสต็อกมั้ย", "คำอธิบายระบุว่าอุปกรณ์เสริมจะไม่เสียค่าใช้จ่ายอะไรเพิ่มเติม แต่ใบแจ้งหนี้ที่พวกเขาเรียกเก็บเงินจากฉันสำหรับอุปกรณ์เสริม"],
    "responses": ["สำหรับการสั่งซื้อ สามารถเลือกดูได้ที่เว็บไซต์ของเรา isalmonyouofficial.com", "เรากำลังพยายามเชื่อมต่อคุณกับผู้ให้บริการที่ใกล้ที่สุด โปรดให้หมายเลขโทรศัพท์หรือที่อยู่อีเมลของคุณ"],
    "context": [""]
    },


    {
    "tag": "response ",
    "patterns": ["99hjiuy@gmail.com", "bccby78@yahoo.com", "xy34z@yolulu.com", "ppojinhgy99@hotmail.com", "56ytu@microsoft.com", "preet5647@yahoo.com", "9876543221", "7896544326", "9415763618", "8888552340", "9909908872", "6754548990"],
    "responses": ["ขอบคุณที่ให้รายละเอียด เราจะติดต่อไปหาคุณในเร็วๆ นี้", "ขอบคุณ คุณจะได้รับการติดต่อจากผู้ให้บริการของเราเร็วๆ นี้", "ขอบคุณที่ให้รายละเอียด"],
    "context": [""]
    },
    {
    "tag": "response_mobile ",
    "patterns": ["9876543221", "7896544326", "9415763618", "8888552340", "9909908872", "6754548990"],
    "responses": ["ขอบคุณที่ให้รายละเอียด เราจะติดต่อคุณในไม่ช้า", "ขอบคุณ แล้วเราจะติดต่อกลับไป", "ขอบคุณที่ให้รายละเอียด"],
    "context": [""]
    },
    {
    "tag": "time",
    "patterns": ["ผู้ให้บริการจะเชื่อมต่อกับฉันเมื่อไหร่ คุณช่วยบอกเวลาโดยประมาณให้ฉันได้ไหม", "ฉันจะได้รับข้อมูลเมื่อใด ฉันไม่ว่างระหว่าง 8 ถึง 5 ช่อง ฉันจะรับสายไม่ได้", "เจ้าหน้าที่ให้บริการได้ไหม ไม่คุยกับฉันตอนนี้เลย ฉันจะไม่ว่าง", "แล้วถ้าฉันไม่ว่างเมื่อได้รับสาย", "คุณบอกฉันได้ไหมว่าฉันจะรับสาย", "ฉันจะได้รับจดหมายเมื่อใด", " ฉันจะต้องอธิบายรายละเอียดให้คนอื่นฟังอีกครั้งหรือไม่", "โทรศัพท์ของฉันมีความจำเป็นไม่สามารถเร่งกระบวนการนี้ได้", "ฉันไม่ว่างทั้งวันและฉันไม่มีโทรศัพท์ติดตัวฉันควรทำอย่างไร? "],
    "responses": ["ผู้ให้บริการของบริษัทของเรามีงานยุ่งมาก แต่ฉันรับรองว่าพวกเขาจะติดต่อคุณโดยเร็วที่สุด", "ขออภัยในความไม่สะดวก แต่ไม่สามารถบอกเวลาโดยประมาณได้ ขึ้นอยู่กับปริมาณงานในแต่ละวัน", "ขออภัยในความไม่สะดวก แต่ผู้ให้บริการจะโทรหาคุณอีกครั้งหากคุณไม่ว่างในขณะนั้น", "ขออภัยในความไม่สะดวก ผู้ให้บริการจะโทรหาคุณจนกว่าคำถามจะไม่ได้รับการแก้ไข"],
    "context": ["search_blood_pressure_by_patient_id"]
    },
    {
    "tag": "Where_is_answer",
    "patterns": ["คำถามของฉันจะได้รับคำตอบเมื่อใด", "แชทยังเปิดอยู่มั้ย", "เรายังอยู่ในแชทมั้ย", "คุณอยู่ที่ไหน คุณยังให้คำปรึกษาอยู่มั้ย", "ฉันจะได้คำตอบเมื่อไหร่" , "คุณอยู่ที่ไหน", "ฉันควรทำยังไง", "คุณวางแผนที่จะตอบคำถามของฉันหรือไม่", "ทำไมคุณไม่ตอบ?"],
    "responses": ["ฉันกำลังมองหาผลลัพธ์ที่อาจต้องใช้เวลาอีกสองสามนาที", "คำตอบสำหรับคำถามของคุณกำลังถูกดูซึ่งอาจใช้เวลาอีกสักครู่", "การแชทยังเปิดอยู่ครับ", "ขออภัยในความล่าช้า เราจะรีบตอบกลับพร้อมคำตอบ", "ฉันกำลังมองหาผลลัพธ์", "อาจใช้เวลาสักครู่"],
    "context": [""]
    },
    {
    "tag": "more help",
    "patterns": ["ฉันต้องการสอบถามเกี่ยวกับราคาในสต็อกของ Iphone13", "คุณช่วยฉันด้วยเกี่ยวกับบริการที่มาพร้อมกับอุปกรณ์เสริมของบริษัทนี้ได้มั้ย", "คุณช่วยบอกราคาของ Iphone12 ได้มั้ย", "คุณช่วยฉันด้วยโทรศัพท์ Iphone รุ่นอายุ 2 ปีได้มั้ย" ,"ยังผลิตและจำหน่ายอยู่มั้ย ", "คุณช่วยฉันเกี่ยวกับนโยบายของศูนย์บริการได้มั้ย", "คุณช่วยหาร้านใกล้ ๆ ที่ซื้อสมาร์ทโฟนให้ฉันด้วยได้มั้ย", "ฉันต้องการสอบถามเกี่ยวกับโทรศัพท์ของฉันที่ฉันซ่อมให้ในศูนย์บริการด้วย"],
    "responses": ["ได้ครับ เราจะเชื่อมต่อคุณกับผู้ให้บริการของเรา อาจต้องใช้เวลาสักครู่", "ยินดีเป็นอย่างยิ่งที่ได้ช่วย", "เราจะเชื่อมต่อคุณกับผู้ให้บริการของเราอย่างแน่นอน", "เราได้แจ้งผู้ให้บริการของเราเกี่ยวกับคำถามของคุณแล้วพวกเขาจะ ติดต่อคุณเร็ว ๆ นี้", "ตรวจสอบราคาได้อย่างแน่นอน โปรดเยี่ยมชมเว็บไซต์ของเราได้เลย", "ในไม่ช้า ผู้ให้บริการจะเชื่อมต่อกับคุณเพื่อขอความช่วยเหลือเพิ่มเติม สามารถเยี่ยมชมเว็บไซต์ของเราก่อนได้"],
    "context": ["search_pharmacy_by_name"]
    },
    {
    "tag": "search_phone_i13_series",
    "patterns": ["ฉันต้องการสอบถามเกี่ยวกับความพร้อมใช้งานของโทรศัพท์ซีรีส์ Iphone13 หรือไม่", "ฉันต้องการสอบถามเกี่ยวกับราคาของ Iphone13", "ฉันต้องการสอบถามเกี่ยวกับการเปิดตัว Iphone13 ในพื้นที่ของฉัน" , "ฉันต้องการสอบถามเกี่ยวกับส่วนลดสำหรับอุปกรณ์เสริมของ Iphone13 ที่มีวางจำหน่ายสิ้นเดือน", "ฉันต้องการสอบถามเกี่ยวกับส่วนลดที่มีในโทรศัพท์มือถือ Iphone13 ในช่วง ปีใหม่", "ฉันต้องสอบถาม เกี่ยวกับคุณลักษณะของรุ่น Iphone13","อุปกรณ์เสริม"],
    "responses": ["สำหรับคำถามใด ๆ เกี่ยวกับรุ่นของโทรศัพท์ซีรีส์ Iphone13 โปรดเยี่ยมชมเว็บไซต์ของเราที่ https://www.apple.com/th/", "สามารถดูคุณสมบัติของโทรศัพท์ซีรีส์ j6 ได้ที่เว็บไซต์อย่างเป็นทางการของเรา https://www.apple.com/th/", "อุปกรณ์เสริมของรุ่น Iphone13 สามารถดูได้ที่ เว็บไซต์อย่างเป็นทางการ https://www.apple.com/th/shop/accessories/all", "ข้อเสนอส่วนลดจะขึ้นอยู่กับยอดขายของพื้นที่และตำแหน่งทางการตลาด ดังนั้นผมขอแนะนำให้ดูที่เว็บไซต์อย่างเป็นทางการของเราเพื่อดูข้อมูลอัปเดตเพิ่มเติมเกี่ยวกับส่วนลด"],
    "context": [""]
    },

    {
    "tag": "delivery",
    "patterns": ["ฉันสั่งสินค้าเมื่อ 2 วันก่อนของจะส่งเมื่อไหร่?", "วันที่จัดส่งผ่านมาแล้ว ยังไม่ได้รับโทรศัพท์เลย", "มีค่าบริการจัดส่งหรือไม่", "การส่งสินค้าถูกรอดำเนินการตั้งแต่สัปดาห์ที่แล้ว", " จะส่งของเมื่อไหร่", "หากโทรศัพท์ได้รับความเสียหายระหว่างการจัดส่ง", "บัตรรับประกันในกล่องโทรศัพท์หายไป", "ระยะเวลาการรับประกันจะเริ่มขึ้นตั้งแต่เดือนที่แล้วฉันซื้อโทรศัพท์เมื่อวานนี้", "ป้อนสถานที่จัดส่งไม่ถูกต้อง", "วันที่จัดส่งผ่านไปแล้วแต่ยังไม่ได้รับ", "การจัดส่งผิดรุ่น"],
    "responses": ["ขออภัยในความไม่สะดวก เราจะให้คนติดต่อคุณในเรื่องนี้ทันที", "เราขอโทษที่ทำให้คุณต้องกังวล เราจะติดต่อคุณทันที"],
    "context": [""]
    }
]}

